# **Create a SQLite database called CourseData.db**

In [23]:
%load_ext sql
%sql sqlite:///CourseData.db

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

'Connected: @CourseData.db'

In [24]:
%%sql
--Dropping tables for when we need to restart and clear CourseData database-- 

DROP TABLE IF EXISTS SECTION;
DROP TABLE IF EXISTS COURSE;
DROP TABLE IF EXISTS INSTRUCTOR;
DROP TABLE IF EXISTS COURSE_MEETINGS;

 * sqlite:///CourseData.db
Done.
Done.
Done.
Done.

[]

In [25]:
%%sql
-- Creating table INSTRUCTOR with surrogate primary key-- 

CREATE TABLE 'INSTRUCTOR' (
    InID INTEGER NOT NULL PRIMARY KEY,
    Name TEXT NOT NULL
);

 * sqlite:///CourseData.db
Done.

[]

In [26]:
%%sql
--Creating table COURSE with CatID as the primary key-- 

CREATE TABLE 'COURSE'(
    CatID VARCHAR PRIMARY KEY,
    Title VARCHAR NOT NULL,
    Description TEXT NOT NULL,
    Credits TEXT NOT NULL,
    PName TEXT NOT NULL,
    PCode TEXT,
    PREREQS TEXT,
    COREQS TEXT,
    FEES INTEGER,
    Attribute TEXT
    
);

 * sqlite:///CourseData.db
Done.

[]

In [27]:
%%sql
--Creating table SECTION with surrogate primary key-- 

CREATE TABLE 'SECTION'(
    SID INTEGER NOT NULL PRIMARY KEY,
    CRN INTEGER NOT NULL,
    Term TEXT NOT NULL,
    Section VARCHAR NOT NULL,
    Cap INTEGER,
    Act INTEGER,
    Rem INTEGER,
    CatID VARCHAR,
    InID INTEGER,
    FOREIGN KEY (CatID) REFERENCES COURSE(CatID),
    FOREIGN KEY (InID) REFERENCES INSTRUCTOR(InID)
);

 * sqlite:///CourseData.db
Done.

[]

In [28]:
%%sql

--Creating table COURSE_MEETINGS with CatID as the Primary Key-- 

CREATE TABLE 'COURSE_MEETINGS' (
    MID INTEGER NOT NULL PRIMARY KEY,
    CRN INTEGER NOT NULL,
    Term TEXT NOT NULL,
    Start TEXT NOT NULL,
    Location VARCHAR NOT NULL,
    Day TEXT NOT NULL,
    End TEXT NOT NULL,
    FOREIGN KEY (CRN) REFERENCES SECTION(CRN),
    FOREIGN KEY (Term) REFERENCES SECTION(Term)
);

 * sqlite:///CourseData.db
Done.

[]

In [29]:
%%sql

--Populating Course_Meetings table using import_course_meetings data-- 

INSERT INTO Course_Meetings (CRN, Term, Start, Location, Day, End)
SELECT DISTINCT crn, term, start, location, day, end 
FROM import_course_meetings;

 * sqlite:///CourseData.db
Done.

[]

In [30]:
%%sql 

--Checking data population of Course_Meetings table-- 

SELECT * 
FROM Course_Meetings
LIMIT 10;

 * sqlite:///CourseData.db
Done.

[(1, 70384, 'Fall2014', '2014-09-02T08:00:00', 'DSB 105', 'T', '2014-09-02T09:15:00'),
 (2, 70384, 'Fall2014', '2014-09-05T08:00:00', 'DSB 105', 'F', '2014-09-05T09:15:00'),
 (3, 70384, 'Fall2014', '2014-09-09T08:00:00', 'DSB 105', 'T', '2014-09-09T09:15:00'),
 (4, 70384, 'Fall2014', '2014-09-12T08:00:00', 'DSB 105', 'F', '2014-09-12T09:15:00'),
 (5, 70384, 'Fall2014', '2014-09-16T08:00:00', 'DSB 105', 'T', '2014-09-16T09:15:00'),
 (6, 70384, 'Fall2014', '2014-09-19T08:00:00', 'DSB 105', 'F', '2014-09-19T09:15:00'),
 (7, 70384, 'Fall2014', '2014-09-23T08:00:00', 'DSB 105', 'T', '2014-09-23T09:15:00'),
 (8, 70384, 'Fall2014', '2014-09-26T08:00:00', 'DSB 105', 'F', '2014-09-26T09:15:00'),
 (9, 70384, 'Fall2014', '2014-09-30T08:00:00', 'DSB 105', 'T', '2014-09-30T09:15:00'),
 (10, 70384, 'Fall2014', '2014-10-03T08:00:00', 'DSB 105', 'F', '2014-10-03T09:15:00')]

In [31]:
%%sql 

--Populating Course table using import_catalogs data--  

INSERT INTO COURSE (CatID, Title, Description, Credits, PName, PCode, PREREQS, COREQS, FEES, Attribute)
SELECT DISTINCT catalog_id, course_title, description, credits, program_name, program_code, prereqs, coreqs, fees, attributes
FROM import_catalogs;

 * sqlite:///CourseData.db
Done.

[]

In [32]:
%%sql 

--Checking data population of Course table-- 

SELECT * 
FROM COURSE
LIMIT 5;

 * sqlite:///CourseData.db
Done.

[('AN 0301', 'Independent Study', 'Students undertake an individualized program of study in consultation with a director from the Asian studies faculty.', '1-3 Credits', 'Asian Studies', 'AN', '', '', '', ''),
 ('AN 0310', 'Asian Studies Seminar', 'This seminar examines selected topics concerning Asia. This course is taught in conjunction with another 100-300 level course from a rotation of cour ... (412 characters truncated) ... e term paper in substitution of some portion of the conjoined course requirements, as determined by the instructor. Open to juniors and seniors only.', '3 Credits', 'Asian Studies', 'AN', '', '', '', ''),
 ('BU 0211', 'Legal Environment of Business', 'This course examines the broad philosophical as well as practical nature and function of the legal system, and introduces students to the legal and s ... (171 characters truncated) ... ivil process, and regulatory areas such as employment discrimination, protection of the environment, and corporate governance and securities markets.', '3 Credits', 'Business', 'BU', 'Junior standing.', '', '', ''),
 ('BU 0220', 'Environmental Law and Policy', 'This course surveys issues arising out of federal laws designed to protect the environment and manage resources. It considers in detail the role of t ... (298 characters truncated) ... t groups in shaping environmental policy, giving special attention to the impact of environmental regulation on business and private property rights.', '3 Credits', 'Business', 'BU', '', '', '', 'EVME Environmental Studies Major Elective, EVPE Environmental Studies Elective, EVSS Environmental Studies: Social Science, MGEL Management: General Elective'),
 ('BU 0311', 'The Law of Contracts, Sales, and Property', 'This course examines the components of common law contracts including the concepts of offer and acceptance, consideration, capacity and legality, ass ... (117 characters truncated) ...  the Uniform Commercial Code relating to leases, sales of goods, and warranties. The course also considers personal and real property, and bailments.', '3 Credits', 'Business', 'BU', 'BU 0211.', '', '', '')]

In [33]:
%%sql 

--Populating Instructor table using import_courses data--  

INSERT INTO Instructor (Name)
SELECT DISTINCT primary_instructor
FROM import_courses
WHERE primary_instructor <> 'TBA' AND primary_instructor NOT LIKE 'primary_instructor' AND primary_instructor NOT LIKE '%/';

 * sqlite:///CourseData.db
Done.

[]

In [34]:
%%sql 

--Checking data population of Instructor table-- 

SELECT * 
FROM Instructor
LIMIT 5;

 * sqlite:///CourseData.db
Done.

[(1, 'Michael P.  Coyne'),
 (2, 'Rebecca I.  Bloch'),
 (3, 'Paul   Caster'),
 (4, 'Jo Ann   Drusbosky'),
 (5, 'Arleen N.  Kardos')]

In [35]:
%%sql 

--Populating the SECTION table using import_courses data--
--Joining Instructor table using import_courses and instructor table--

INSERT INTO SECTION (CRN, Term, Section, Cap, Act, Rem, CatID, InID)
SELECT crn, term, section, cap, act, rem, catalog_id, InID
FROM import_courses
    JOIN Instructor ON (import_courses.primary_instructor = Instructor.Name)
;

 * sqlite:///CourseData.db
Done.

[]

In [36]:
%%sql 

--Checking data population of Section table--

SELECT * 
FROM Section
LIMIT 10;

 * sqlite:///CourseData.db
Done.

[(1, 70384, 'Fall2014', 'C01', 0, 31, -31, 'AC 0011', 1),
 (2, 70385, 'Fall2014', 'C02', 0, 31, -31, 'AC 0011', 1),
 (3, 70382, 'Fall2014', 'C03', 0, 31, -31, 'AC 0011', 1),
 (4, 70291, 'Fall2014', 'C04', 0, 29, -29, 'AC 0011', 2),
 (5, 70350, 'Fall2014', 'C05', 0, 30, -30, 'AC 0011', 2),
 (6, 70381, 'Fall2014', 'C06', 0, 31, -31, 'AC 0011', 2),
 (7, 70383, 'Fall2014', 'G', 30, 31, -1, 'AC 0011', 3),
 (8, 70391, 'Fall2014', 'H', 30, 32, -2, 'AC 0011', 4),
 (9, 71105, 'Fall2014', 'I', 30, 33, -3, 'AC 0011', 4),
 (10, 71123, 'Fall2014', 'J', 30, 32, -2, 'AC 0011', 4)]

In [37]:
%%sql
SELECT COUNT(CatID) 
FROM COURSE
WHERE Credits = '4 Credits' 
LIMIT 5;

 * sqlite:///CourseData.db
Done.

[(55,)]

In [38]:
%%sql
SELECT COUNT(InID) 
FROM Instructor 
LIMIT 5;

 * sqlite:///CourseData.db
Done.

[(1103,)]

In [39]:
%%sql 

SELECT (SUM(strftime('%s',End)-strftime('%s',Start))/60)/60 AS CourseHours, CRN, Location, Term
FROM Course_Meetings
GROUP BY Location, Term
ORDER BY CourseHours DESC
LIMIT 10;

 * sqlite:///CourseData.db
Done.

[(1142, 31036, 'SON 203', 'Spring2017'),
 (1076, 34033, 'NHS 224', 'Spring2018'),
 (994, 31444, 'YAL ', 'Spring2017'),
 (989, 75648, 'BY ARR ', 'Fall2015'),
 (938, 37882, 'YAL ', 'Spring2019'),
 (910, 77724, 'YAL ', 'Fall2016'),
 (903, 71483, 'VA ', 'Fall2017'),
 (899, 37032, 'NHS 224', 'Spring2019'),
 (890, 71543, 'YAL ', 'Fall2014'),
 (862, 74666, 'BNW 127', 'Fall2018')]

In [40]:
%%sql 

SELECT COUNT(CRN), Location, Term, (SUM(strftime('%s',End)-strftime('%s',Start))/60)/60 AS CourseHours
FROM Course_Meetings
GROUP BY Location, Term
ORDER BY CourseHours DESC
LIMIT 20;

 * sqlite:///CourseData.db
Done.

[(343, 'SON 203', 'Spring2017', 1142),
 (303, 'NHS 224', 'Spring2018', 1076),
 (156, 'YAL ', 'Spring2017', 994),
 (133, 'BY ARR ', 'Fall2015', 989),
 (134, 'YAL ', 'Spring2019', 938),
 (130, 'YAL ', 'Fall2016', 910),
 (129, 'VA ', 'Fall2017', 903),
 (268, 'NHS 224', 'Spring2019', 899),
 (141, 'YAL ', 'Fall2014', 890),
 (590, 'BNW 127', 'Fall2018', 862),
 (456, 'DSB 106', 'Fall2018', 843),
 (359, 'DSB 111', 'Spring2016', 837),
 (370, 'DSB 112', 'Fall2014', 833),
 (117, 'VA ', 'Fall2018', 819),
 (393, 'DSB 105', 'Spring2019', 816),
 (102, 'DSB 110', 'Spring2016', 816),
 (606, 'BNW 137', 'Fall2018', 803),
 (397, 'DSB 111', 'Spring2017', 796),
 (468, 'DSB 109', 'Spring2017', 792),
 (113, 'VA ', 'Spring2018', 791)]

In [41]:
%%sql
SELECT COUNT(InID) AS AmountTaught, InID, Term
FROM SECTION
GROUP BY InID, Term
ORDER BY AmountTaught DESC
LIMIT 10;

 * sqlite:///CourseData.db
Done.

[(108, 730, 'Fall2017'),
 (64, 173, 'Fall2017'),
 (54, 730, 'Fall2018'),
 (51, 730, 'Fall2016'),
 (50, 245, 'Fall2015'),
 (46, 245, 'Fall2014'),
 (32, 173, 'Spring2016'),
 (31, 173, 'Fall2015'),
 (31, 173, 'Fall2016'),
 (31, 173, 'Spring2017')]

In [42]:
%%sql 
SELECT InID, Term, Name, Count(Name) AS NumCoursesTaught
FROM Instructor
    JOIN SECTION USING (InID)
GROUP BY InID, Term
ORDER BY NumCoursesTaught ASC
LIMIT 10;

 * sqlite:///CourseData.db
Done.

[(1, 'Summer2017', 'Michael P.  Coyne', 1),
 (1, 'Summer2018', 'Michael P.  Coyne', 1),
 (6, 'Spring2015', 'Scott M  Brenner', 1),
 (6, 'Spring2016', 'Scott M  Brenner', 1),
 (6, 'Spring2017', 'Scott M  Brenner', 1),
 (6, 'Spring2018', 'Scott M  Brenner', 1),
 (7, 'Fall2014', 'Kevin C.  Cassidy', 1),
 (7, 'Spring2016', 'Kevin C.  Cassidy', 1),
 (10, 'Fall2015', 'Stephen E.  Yost', 1),
 (10, 'Fall2016', 'Stephen E.  Yost', 1)]

In [43]:
%%sql 
SELECT AVG(CAP) as AverageCapacity
FROM SECTION 
WHERE CAP>10;

 * sqlite:///CourseData.db
Done.

[(22.9560507107184,)]

In [44]:
%%sql
SELECT * 
FROM SECTION 
Where InID = '174';

 * sqlite:///CourseData.db
Done.

[(416, 73240, 'Fall2014', 'AA3', 19, 19, 0, 'EN 0011', 174),
 (442, 70909, 'Fall2014', 'KK', 19, 18, 1, 'EN 0011', 174),
 (1912, 75013, 'Fall2015', 'C01', 0, 19, -19, 'EN 0011', 174),
 (1918, 75548, 'Fall2015', 'C08', 0, 19, -19, 'EN 0011', 174),
 (1954, 75035, 'Fall2015', 'W', 19, 19, 0, 'EN 0011', 174),
 (3386, 77015, 'Fall2016', '09', 19, 17, 2, 'EN 0011', 174),
 (3423, 77678, 'Fall2016', '46C', 0, 18, -18, 'EN 0011', 174),
 (4866, 71015, 'Fall2017', '09', 19, 19, 0, 'EN 0011', 174),
 (4884, 71334, 'Fall2017', '27', 19, 19, 0, 'EN 0011', 174),
 (4895, 71439, 'Fall2017', '39', 19, 18, 1, 'EN 0011', 174),
 (6332, 71015, 'Fall2017', '09', 19, 19, 0, 'EN 0011', 174),
 (6350, 71334, 'Fall2017', '27', 19, 19, 0, 'EN 0011', 174),
 (6361, 71439, 'Fall2017', '39', 19, 18, 1, 'EN 0011', 174),
 (7829, 74015, 'Fall2018', '09C', 0, 18, -18, 'EN 0011', 174),
 (7847, 74314, 'Fall2018', '27C', 0, 18, -18, 'EN 0011', 174),
 (9314, 31962, 'Spring2015', 'EE', 19, 18, 1, 'EN 0012', 174),
 (9318, 31838, 'Spring2015', 'GG', 19, 20, -1, 'EN 0012', 174),
 (9353, 33222, 'Spring2015', 'Y', 19, 19, 0, 'EN 0012', 174),
 (10697, 37005, 'Spring2016', 'D', 19, 17, 2, 'EN 0012', 174),
 (10729, 37578, 'Spring2016', 'TT', 19, 19, 0, 'EN 0012', 174),
 (12105, 31007, 'Spring2017', '07', 19, 19, 0, 'EN 0012', 174),
 (12144, 32788, 'Spring2017', '48', 19, 19, 0, 'EN 0012', 174),
 (12183, 31826, 'Spring2017', '01', 15, 15, 0, 'ENW 0205', 174),
 (13502, 34007, 'Spring2018', '07', 19, 19, 0, 'EN 0012', 174),
 (13539, 35268, 'Spring2018', '45', 19, 18, 1, 'EN 0012', 174),
 (13547, 35276, 'Spring2018', 'OL1', 17, 17, 0, 'EN 0101', 174),
 (14947, 37007, 'Spring2019', '07', 19, 19, 0, 'EN 0012', 174),
 (14983, 37992, 'Spring2019', '44', 19, 19, 0, 'EN 0012', 174),
 (16366, 56157, 'Summer2016', 'OL1', 20, 6, 14, 'EN 0012', 174),
 (16678, 57114, 'Summer2017', 'OL1', 20, 9, 11, 'EN 0012', 174)]